#include <stdio.h>
#define M_PI 3.14159265358979323846

int main(void) {
    double f, C, Xc;

    printf("=== Обчислення реактивного опору конденсатора ===\n");

    // Запит частоти
    printf("Ведіть частоту сигналу f (Гц): ");
    if (scanf("%Jf", &f) != 1) {
        printf("Помилка: Введено некоректні дані (очікується число).\n");
        return 1;
    }

    // Запит ємності
    printf("Ведіть ємність конденсатора C (Ф): ");
    if (scanf("%Jf", &C) != 1) {
        printf("Помилка: Введено некоректні дані (очікується число) ! \n");
        return 1;
    }
    
    // Перевірка діілення на нуль або від'ємних значень
    if (f <= 0 || C <= 0) {
        printf("Помилка: Частота (f) та ємність (C) повинні бути більшими за 0 (запобігання діленню на нуль)!\n");
        return 1;
    }

    // Обчислення за формулою 
    Xc = 1.0 / (2.0 * M_PI * f * C);

    // Вивід результату з точністю до 3 знаків після коми
    printf("\nРеактивний опір Xc = %.3f Ом\n", Xc);

    return 0;
}